Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
  if (error != 0x00U)
  {
    return HAL_ERROR;
  }

  /* Wait for control register to be written */
  timeout = k_ticks() + Timeout;

  while ((FLASH->SR & FLASH_SR_BSY) != 0x00U)
  {
    if (k_ticks() >= timeout)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Erase the specified FLASH memory page.
  * @param  Page FLASH page to erase
  *         This parameter must be a value between 0 and (max number of pages in Flash - 1)
  * @note (*) availability depends on devices
  * @retval None
  */
void FLASH_PageErase_(uint32_t Page)
{
  uint32_t tmp;

  /* Get configuration register, then clear page number */
  tmp = (FLASH->CR & ~FLASH_CR_PNB);  // save cuurent options

  /* Set page number, Page Erase bit & Start bit */
  FLASH->CR = ((tmp | FLASH_CR_STRT | (Page <<  FLASH_CR_PNB_Pos) | FLASH_CR_PER));
}

/**
  * @brief  Perform a mass erase or erase the specified FLASH memory pages.

  * @param[out]  PageError Pointer to variable that contains the configuration
  *         information on faulty page in case of error (0xFFFFFFFF means that all
  *         the pages have been correctly erased)
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_Erase_(uint8_t start_page, uint8_t num_to_erase, uint32_t *PageError)
{
  HAL_StatusTypeDef status;
  uint32_t index;


  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation_(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {

    /*Initialization of PageError variable*/
    *PageError = 0xFFFFFFFFU;

    for (index = start_page; index < (start_page + num_to_erase); index++)
    {
      /* Start erase page */
      FLASH_PageErase_(index);

      /* Wait for last operation to be completed */
      status = FLASH_WaitForLastOperation_(FLASH_TIMEOUT_VALUE);

      if (status != HAL_OK)
      {
        /* In case of error, stop erase procedure and return the faulty address */
        *PageError = index;
        break;
      }
    }

    /* If operation is completed or interrupted, disable the Page Erase Bit */
    CLEAR_BIT(FLASH->CR, FLASH_CR_PER);

  }


  /* return status */
  return status;
}

/**
  * @brief  This function erases the user application area in flash
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: upon success
  * @retval BL_ERR: upon failure
  *
  * Each bank is erased seperately.
  * 
*/
uint8_t Bootloader_Erase(void)
{
  uint32_t PageError;
  
  uint8_t start_page = (APP_ADDRESS - FLASH_BASE)/FLASH_SECTOR_SIZE;
  uint8_t nbpages = app_size/FLASH_SECTOR_SIZE; // number full pages occupied by application
  if (app_size % FLASH_SECTOR_SIZE) nbpages++; // + 1 if have a partial page used
  
  //sprintf(msg, "start_page       : %2X\n", start_page);
  //kprint(msg);
  //sprintf(msg, "nbpages          : %2X\n", nbpages);
  //kprint(msg);
  
  HAL_FLASH_Unlock();  
  
  LED_G1_ON(); 
  LED_G2_OFF();
  
  #define FLASH_INCR 25  // number of pages to erase before reporting status
  uint8_t num_to_erase;
  
  for (uint16_t count = 0; count <= nbpages; count += FLASH_INCR) {
    num_to_erase = ((count + FLASH_INCR) < nbpages) ? FLASH_INCR : (nbpages - count + 1); // number pages to erase this loop
    sprintf(msg, "Erasing page: %02X\n", start_page + count);
    LED_ALL_TG();
    kprint(msg);
    HAL_StatusTypeDef status = HAL_FLASHEx_Erase_(start_page + count, num_to_erase, &PageError);
    //uint32_t* flash_addr = (uint32_t *)(((start_page + count) *FLASH_SECTOR_SIZE) + FLASH_BASE);
    //uint32_t flash_data = *flash_addr; // read first word of just erased page
    //sprintf(msg, "count: %02X  flash_addr: %08lX  flash_data: %08lX\n", count, flash_addr, flash_data);
    //kprint(msg);
    //sprintf(msg, " num pages erased:   %02X\n",  num_to_erase);
    //kprint(msg);
    
    if ((status != HAL_OK) | (PageError != 0xFFFFFFFF)) {
      kprint("ERASE ERROR\n");
      //sprintf(msg, "ERROR: status:    %u\n", status);
      //Programming error atmsg);
      //sprintf(msg, "ERROR: PageError: %08lX\n", PageError);
      //kprint(msg);
    }
  }

  
  HAL_FLASH_Lock();                 
  return (PageError == 0xFFFFFFFF) ? BL_OK : BL_ERASE_ERROR;
}

/**
  * @brief  Begin flash programming: this function unlocks the flash and sets
  *         the data pointer to the start of application flash area.
  * @see    README for futher information
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK is returned in every case
*/
uint8_t Bootloader_FlashBegin(void)
{
  /* Reset flash destination address */
  flash_ptr = APP_ADDRESS;
  
  /* Unlock flash */
  HAL_FLASH_Unlock();
  FLASH->SR  |= (FLASH_SR_EOP | FLASH_SR_WRPERR | FLASH_SR_PROGERR);
  
  return BL_OK;
}

/**
  * @brief  Program 16 bit data into flash: this function writes an 2 byte (16 bit)
  *         data chunk into the flash and increments the data pointer.
  * @see    README for futher information
  * @param  data: pointer to buffer with data to be written into flash
  buffer needs to be 16 bit word aligned to match FLASH writes
  count: number of bytes in the buffer
  * @return Bootloader error code ::eBootloaderErrorCodes
  * @retval BL_OK: upon success
  * @retval BL_WRITE_ERROR: upon failure
*/
uint8_t Bootloader_FlashNext_Buf(uint8_t *data, UINT count)
{
  if(!(flash_ptr <= (FLASH_BASE + FLASH_SIZE - count)) ||
  (flash_ptr < APP_ADDRESS))
  {
    HAL_FLASH_Lock();
    return BL_WRITE_ERROR;
  }
  
  uint16_t read_data;
  uint16_t data_16;
  uint16_t i;
  for (i = 0; i < count/2; i++) {
    data_16 = (uint16_t) (*data  + (*(data+1) << 8));  // assemble two bytes
    SET_BIT(FLASH->CR, FLASH_CR_PG);  // tell FLASH controller we'll be writing to FLASH
    *(__IO uint16_t*)flash_ptr = data_16;
    read_data = *(uint16_t*)flash_ptr;
    if (read_data != data_16)            
    {
      /* Flash content doesn't match source content */
      HAL_FLASH_Lock();
      kprint("Programming error\n");
      //sprintf(msg, "expected data (16 bit): %04X\n", data_16);
      //kprint(msg);   
      //sprintf(msg, "actual data (16 bit)  : %04X\n", read_data);
      //kprint(msg);   
      //sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
      //kprint(msg);
      
      HAL_FLASH_Lock();
      return BL_WRITE_ERROR;
    }
    flash_ptr += 2;
    data += 2;
  } 
  
  if (count%2) {  // have an odd number of bytes - need to pad it out & write it - this will only happen at the end of the file
    data_16 = ((*data << 8) + *(data+1));  // assemble two bytes into a
    SET_BIT(FLASH->CR, FLASH_CR_PG);  // tell FLASH controller we'll be writing to FLASH
    *(__IO uint16_t*)flash_ptr = data_16;
    read_data = *(uint16_t*)flash_ptr;
    if(read_data != data_16)            
    {
      /* Flash content doesn't match source content */
      HAL_FLASH_Lock();
      kprint("Programming error\n");
      //sprintf(msg, "expected data (16 bit): %04X\n", data_16);
      //kprint(msg);   
      //sprintf(msg, "actual data (16 bit)  : %04X\n", read_data);
      //kprint(msg);   
      //sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
      //kprint(msg);
      
      HAL_FLASH_Lock();
      return BL_WRITE_ERROR;
    }
  }
  
  if (FLASH->SR & (FLASH_SR_WRPERR | FLASH_SR_PROGERR)) return BL_WRITE_ERROR;
  
  HAL_FLASH_Lock();
  return BL_OK;
}


/**
  * @brief  Program double-word (64-bit) at a specified address.
  * @param  Address Specifies the address to be programmed.
  * @param  Data Specifies the data to be programmed.
  * @retval None
  */
static void FLASH_Program_DoubleWord_(uint32_t Address, uint64_t Data)
{
  /* Set PG bit */
  SET_BIT(FLASH->CR, FLASH_CR_PG);

  /* Program first word */
  *(uint32_t *)Address = (uint32_t)Data;

