Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
  HAL_FLASH_Unlock();
  HAL_FLASH_OB_Unlock();
  while( rd32(R_FLASH_SR) & FLASH_SR_BSY);  // wait until BSY is inactive before programming
  
  uint8_t* wrp1ar_strt_ptr = (uint8_t*)0x4002202C;
  uint8_t* wrp1ar_end_ptr  = (uint8_t*)0x4002202E;
  uint8_t* wrp1br_strt_ptr = (uint8_t*)0x40022030;
  uint8_t* wrp1br_end_ptr  = (uint8_t*)0x40022032;
    
  #define FLASH_WRP_MSK 0x0000007F   
  
  *wrp1ar_strt_ptr = (uint8_t)(data[0] & FLASH_WRP_MSK); 
  *wrp1ar_end_ptr  = (uint8_t)((data[0] >> 16) & FLASH_WRP_MSK); 
  *wrp1br_strt_ptr = (uint8_t)(data[1] & FLASH_WRP_MSK); 
  *wrp1br_end_ptr  = (uint8_t)((data[1] >> 16) & FLASH_WRP_MSK);
   
  
  //FLASH_OBProgramInitTypeDef pOBInit ={0};
  //HAL_FLASHEx_OBGetConfig(&pOBInit);
  //
  //pOBInit.OptionType = OPTIONBYTE_WRP;
  //pOBInit.WRPArea = OB_WRPAREA_ZONE_A; // OB_WRPAREA_ZONE_A, OB_WRPAREA_ZONE_B , OB_WRPAREA_ZONE2_A, OB_WRPAREA_ZONE2_B
  //pOBInit.WRPStartOffset = 0x2;  //  zero based sector/page number
  //pOBInit.WRPEndOffset = 0x4; 
  //
  //HAL_FLASHEx_OBProgram(&pOBInit);
  //
  or32(R_FLASH_CR , FLASH_CR_OPTSTRT);   //starts option byte programming
  while( rd32(R_FLASH_SR) & FLASH_SR_BSY);  // wait until BSY is inactive
  or32(R_FLASH_CR , FLASH_CR_OBL_LAUNCH);  //sends system through reset which makes the new option bytes active.
  HAL_FLASH_OB_Lock();   // should never be executed
  HAL_FLASH_Lock();   // should never be executed
  
  return BL_OK;
}

void Bootloader_ConfigProtection_Save(uint32_t *data) {  
  /*           @arg @ref OB_WRPAREA_ZONE_A Flash Zone A
    *           @arg @ref OB_WRPAREA_ZONE_B Flash Zone B
    *           @arg @ref OB_WRPAREA_ZONE2_A Flash Bank 2 Zone A (*)
    *           @arg @ref OB_WRPAREA_ZONE2_B Flash Bank 2 Zone B (*)
    * @note  (*) availability depends on devices
    * @param  WRPStartOffset  Specifies the start page of the write protected area
    *         This parameter can be page number between 0 and (max number of pages in the Flash Bank - 1)
    * @param  WRDPEndOffset  Specifies the end page of the write protected area
    *         This parameter can be page number between WRPStartOffset and (max number of pages in the Flash Bank - 1)
    * @retval None
  */
  
  data[0] = rd32(R_FLASH_WRP1AR);
  data[1] = rd32(R_FLASH_WRP1BR);
  
}

void Bootloader_ConfigProtection_Clear(uint32_t *data) {  
  
  data[0] = 0x0000007F; // start > end so no protection
  data[1] = 0x0000007F; // start > end so no protection

  
}


// remove protection from application area
// 
// To simplify the logic, wrp1a and wrp1b are treated as one large protection area
//   the final wrp1a holds the protected area before the application
//   the final wrp1b holds the protected area after the application
//
// NOTE: this may protect pages not originally protected.  That's not a problem
//       because the "extra" pages don't get written to and the original
//       protection is restored later in the program.
//
// always sends system through reset
void Bootloader_ConfigProtection_Keep_Boot(void) {  
  
  #define WITHIN(N,L,H)       ((N) >= (L) && (N) <= (H))
  #define MIN_2(a,b)      ((a)<(b)?(a):(b))
  #define MAX_2(a,b)      ((a)>(b)?(a):(b))
  uint32_t temp_wrp[4] = {0};
  
  if (app_size) {
    
    uint8_t first_app_page = (APP_ADDRESS - FLASH_BASE)/ FLASH_SECTOR_SIZE;
    uint8_t last_app_page = ((app_size/FLASH_SECTOR_SIZE) + first_app_page);
    if (app_size % FLASH_SECTOR_SIZE) last_app_page++;  // include partial page
 
    uint8_t wrp_strt = MIN_2(wrp1a_strt, wrp1b_strt);  // combine wrp1a and wrp1b into one large virtual area
    uint8_t wrp_end  = MAX_2(wrp1a_end, wrp1b_end);
    sprintf(msg, "wrp_strt: %2X\n", wrp_strt);
    kprint(msg);
    sprintf(msg, "wrp_end:  %2X\n", wrp_end);
    kprint(msg);
      
      
    temp_wrp[0] = 0x0000007F;         // set default as disabled (set last < start)
    temp_wrp[1] = 0x0000007F;         // set default as disabled (set last < start)

    if (wrp_end >= wrp_strt) {
      // CASE A - wrp starts in app area
      if (WITHIN(wrp_strt, first_app_page, last_app_page)) {
        if ( wrp_end <= last_app_page) {  
          // CASE A1 - wrp entirely within application area
          kprint("CASE: A1\n");
          //temp_wrp[0] = 0x0000007F;         // disable wrp (set last < start)
          //temp_wrp[1] = 0x0000007F;         // disable wrp (set last < start)
        }
        else {
          // CASE A2 - wrp extends beyond application
          kprint("CASE: A2\n");
          temp_wrp[0] = (last_app_page | (wrp_end << 16));  // application is partially within wrp
          //temp_wrp[1] = 0x0000007F;                         // disable wrp1b (set last < start)
        }
      }  
      // CASE B - wrp starts before application
      else if (WITHIN(wrp_strt, 0, first_app_page -1)) {
        if (WITHIN(wrp_end, 0, first_app_page -1)) {
          // CASE B1 - wrp entirely before application area
          kprint("CASE: B1\n");
          //temp_wrp[0]                                                                                                                                                                                  = rd32(R_FLASH_WRPR);  // no change to wrp
          temp_wrp[0] = (wrp1a_strt | (wrp1a_end << 16));   // no change to wrp
          temp_wrp[1] = (wrp1b_strt | (wrp1b_end << 16));   // no change to wrp
        }
        else if (WITHIN(wrp_end, 0, last_app_page)) {
            // CASE B2 - wrp starts before application area but stops within application area
            kprint("CASE: B2\n");
            temp_wrp[0] = (wrp_strt | ((first_app_page - 1) << 16));  // wrp end to end of area before application
            //temp_wrp[1] = 0x0000007F;                               // disable wrp1b (set last < start)
          }
          else {
            // CASE B3 - wrp starts before application area but extends beyond application area
            kprint("CASE: B3\n");
            //           thgis requires trying to use wrp1b to protect the area beyond the application.
             temp_wrp[0] = (wrp_strt | ((first_app_page - 1) << 16));  // wrp1a used for area before application
             temp_wrp[1] = (last_app_page + 1 | (wrp_end << 16));          // wrp1b used for area after application
          } 
      }
      else {
        // CASE C - wrp starts beyond the application so no changes needed
        kprint("CASE: C\n");
        temp_wrp[0] = (wrp1a_strt | (wrp1a_end << 16));   // no change to wrp
        temp_wrp[1] = (wrp1b_strt | (wrp1b_end << 16));   // no change to wrp
      }
    }  // end wrp
    
