Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
}


/**
  * @brief  This function performs the jump to the user application in flash.
  * @details The function carries out the following operations:
  *  - Sets the flag that we should load application after the next reset
  *  - Sends the card through reset
  *  
  *  The reset handler checks this flag and will either continue to start the
  *  bootloader or it will start the application.
*/

void Bootloader_JumpToApplication(void) {
  
  Magic_Location = Magic_Application;  // flag that we should load application 
  // after the next reset
  NVIC_System_Reset();                  // send the system through reset
}


/**
  * @brief  This function returns the version number of the bootloader library.
  *         Semantic versioning is used for numbering.
  * @see    Semantic versioning: https://semver.org
  * @return Bootloader version number combined into an uint32_t:
  *          - [31:24] Major version
  *          - [23:16] Minor version
  *          - [15:8]  Patch version
  *          - [7:0]   Release candidate version
*/
//uint32_t Bootloader_GetVersion(void)
//{
//    return ((BOOTLOADER_VERSION_MAJOR << 24) |
//            (BOOTLOADER_VERSION_MINOR << 16) | (BOOTLOADER_VERSION_PATCH << 8) |
//            (BOOTLOADER_VERSION_RC));
//}


/**
  \brief   System Reset
  \details Initiates a system reset request to reset the MCU.
*/
void NVIC_System_Reset(void)
{
  #define SCB_AIRCR_VECTKEY_Pos 16U   /*!< SCB AIRCR: VECTKEY Position */
  #define SCB_AIRCR_SYSRESETREQ_Pos 2U   /*!< SCB AIRCR: VECTKEY Position */
  volatile uint32_t* SCB_AIRCR = (uint32_t*)0xE000ED0CUL;  
  
  *SCB_AIRCR = (uint32_t)(((0x5FAUL << SCB_AIRCR_VECTKEY_Pos) | (1 << SCB_AIRCR_SYSRESETREQ_Pos)));
  
  for(;;)                                                           /* wait until reset */
  {
  }
}
